update diagram
